package com.rowoffer;

/**
 * 给定一个由 0 和 1 组成的非空二维数组 grid ，用来表示海洋岛屿地图。
 *
 * 一个 岛屿 是由一些相邻的 1 (代表土地) 构成的组合，这里的「相邻」要求两个 1 必须在水平或者竖直方向上相邻。你可以假设 grid 的四个边缘都被 0（代表水）包围着。
 *
 * 找到给定的二维数组中最大的岛屿面积。如果没有岛屿，则返回面积为 0 。
 *
 *  
 *
 * 来源：力扣（LeetCode）
 * 链接：https://leetcode-cn.com/problems/ZL6zAn
 * 著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
 *
 *
 *
 * 思路，找到一个，就把这个岛屿给填了，都变为0
 *
 *
 * [0,0,1,0,0,0,0,1,0,0,0,0,0],
 * [0,0,0,0,0,0,0,1,1,1,0,0,0],
 * [0,1,1,0,1,0,0,0,0,0,0,0,0],
 * [0,1,0,0,1,1,0,0,1,0,1,0,0],
 * [0,1,0,0,1,1,0,0,1,1,1,0,0],
 * [0,0,0,0,0,0,0,0,0,0,1,0,0],
 * [0,0,0,0,0,0,0,1,1,1,0,0,0],
 * [0,0,0,0,0,0,0,1,1,0,0,0,0]]
 *
 *
 * [0,0,X,0,0,0,0,x,0,0,0,0,0],
 * [0,0,0,0,0,0,0,x,x,x,0,0,0],
 * [0,x,x,0,x,0,0,0,0,0,0,0,0],
 * [0,x,0,0,x,x,0,0,x,0,x,0,0],
 * [0,x,0,0,x,x,0,0,x,x,x,0,0],
 * [0,0,0,0,0,0,0,0,0,0,x,0,0],
 * [0,0,0,0,0,0,0,x,x,x,0,0,0],
 * [0,0,0,0,0,0,0,x,x,0,0,0,0]]
 *
 */
public class MaxAreaOfIsland {
    public int maxAreaOfIsland(int[][] grid) {
        //找到岛屿，就把所有的位置变为0
        return 0;
    }
}