package com.algorithm._7_digui;

/**
 * 8皇后的代码还是比较简单的
 * 1、第一行就0开始
 * 2.第二行从0开始
 * ……
 * 次数 8x8x8x8x8x8x8x8
 *
 *      *
 *      * 04752613
 *      * 05726314
 *      * 06357142
 *      * 06471352
 *      * 13572064
 *      * 14602753
 *      * 14630752
 *      * 15063724
 *      * 15720364
 *      * 16257403
 *      * 16470352
 *      * 17502463
 *      * 20647135
 *      * 24170635
 *      * 24175360
 *      * 24603175
 *      * 24730615
 *      * 25147063
 *      * 25160374
 *      * 25164073
 *      * 25307461
 *      * 25317460
 *      * 25703641
 *      * 25704613
 *      * 25713064
 *      * 26174035
 *      * 26175304
 *      * 27360514
 *      * 30471625
 *      * 30475261
 *      * 31475026
 *      * 31625704
 *      * 31625740
 *      * 31640752
 *      * 31746025
 *      * 31750246
 *      * 35041726
 *      * 35716024
 *      * 35720641
 *      * 36074152
 *      * 36271405
 *      * 36415027
 *      * 36420571
 *      * 37025164
 *      * 37046152
 *      * 37420615
 *      * 40357162
 *      * 40731625
 *      * 40752613
 *      * 41357206
 *      * 41362750
 *      * 41506372
 *      * 41703625
 *      * 42057136
 *      * 42061753
 *      * 42736051
 *      * 46027531
 *      * 46031752
 *      * 46137025
 *      * 46152037
 *      * 46152073
 *      * 46302751
 *      * 47302516
 *      * 47306152
 *      * 50417263
 *      * 51602473
 *      * 51603742
 *      * 52064713
 *      * 52073164
 *      * 52074136
 *      * 52460317
 *      * 52470316
 *      * 52613704
 *      * 52617403
 *      * 52630714
 *      * 53047162
 *      * 53174602
 *      * 53602417
 *      * 53607142
 *      * 57130642
 *      * 60275314
 *      * 61307425
 *      * 61520374
 *      * 62057413
 *      * 62714053
 *      * 63147025
 *      * 63175024
 *      * 64205713
 *      * 71306425
 *      * 71420635
 *      * 72051463
 *      * 73025164
 */
public class EightHuanghou {

    int max = 8;
    int []array = new int[max];
    static int count = 0;
    static int judgeCount = 0;

    public static void main(String[] args) {
        EightHuanghou huanghou = new EightHuanghou();
        huanghou.check(0);
    }

    int xxx = 0;
    private void check(int n) {
        if (n == max){
            print();
            return;
        }
        for (int i = 0; i < max; i++) {
            array[n] = i;
            //如果不型就直接放弃
            if (judge(n)){
                check(n+1);
            }
//            array[n] = 0;
        }
    }

    private boolean judge(int n) {
        judgeCount++;
        for (int i = 0; i < n; i++) {
            if (array[i] == array[n] || Math.abs(n-i) == Math.abs(array[n] - array[i])){
                return false;
            }
        }
        return true;
    }

    private void print() {
        count++;
        System.out.println("第"+count);
        for (int i = 0; i < array.length; i++) {
            System.out.print(array[i]);
        }
        System.out.println();
    }

}
